<?php

return [
    'custom' => [
        'name' => [
            'required' => 'נא להזין שם מלא.',
            'min' => 'השם חייב להכיל לפחות :min תווים.',
        ],
        'email' => [
            'required' => 'נא להזין כתובת אימייל.',
            'email' => 'נא להזין כתובת אימייל תקינה.',
            'unique' => 'קיים כבר חשבון עם כתובת אימייל זו.',
        ],
        'password' => [
            'required' => 'נא להזין סיסמה.',
            'min' => 'הסיסמה חייבת להכיל לפחות :min תווים.',
            'confirmed' => 'אימות הסיסמה אינו תואם.',
            'letters' => 'הסיסמה חייבת להכיל לפחות אות אחת.',
            'mixed' => 'הסיסמה חייבת להכיל אותיות גדולות וקטנות.',
            'numbers' => 'הסיסמה חייבת להכיל לפחות ספרה אחת.',
        ],
        'code' => [
            'required' => 'נא להזין את קוד האימות.',
            'size' => 'הקוד חייב להכיל בדיוק :size ספרות.',
            'digits' => 'הקוד יכול להכיל ספרות בלבד.',
        ],
        'token' => [
            'required' => 'לקישור האיפוס חסר מידע נדרש.',
        ],
    ],
];
